TEAM-RD0105/MasterProject/MasterModel/RD0105FirmwareModel_Config/RTD/include/S32K39_DSPI_MSC_WRAPPER.h
#define DSPI_RSER_DSITCF_RE_MASK             DSPI_MSC_RSER_DSITCF_RE_MASK
#define DSPI_RSER_DSITCF_RE_SHIFT            DSPI_MSC_RSER_DSITCF_RE_SHIFT
#define DSPI_RSER_DSITCF_RE_WIDTH            DSPI_MSC_RSER_DSITCF_RE_WIDTH
#define DSPI_RSER_DSITCF_RE(x)               DSPI_MSC_RSER_DSITCF_RE(x)

#define DSPI_RSER_EOQF_RE_MASK               DSPI_MSC_RSER_EOQF_RE_MASK
#define DSPI_RSER_EOQF_RE_SHIFT              DSPI_MSC_RSER_EOQF_RE_SHIFT
#define DSPI_RSER_EOQF_RE_WIDTH              DSPI_MSC_RSER_EOQF_RE_WIDTH
#define DSPI_RSER_EOQF_RE(x)                 DSPI_MSC_RSER_EOQF_RE(x)

#define DSPI_RSER_SPITCF_RE_MASK             DSPI_MSC_RSER_SPITCF_RE_MASK
#define DSPI_RSER_SPITCF_RE_SHIFT            DSPI_MSC_RSER_SPITCF_RE_SHIFT
#define DSPI_RSER_SPITCF_RE_WIDTH            DSPI_MSC_RSER_SPITCF_RE_WIDTH
#define DSPI_RSER_SPITCF_RE(x)               DSPI_MSC_RSER_SPITCF_RE(x)

#define DSPI_RSER_CMDFFF_RE_MASK             DSPI_MSC_RSER_CMDFFF_RE_MASK
#define DSPI_RSER_CMDFFF_RE_SHIFT            DSPI_MSC_RSER_CMDFFF_RE_SHIFT
#define DSPI_RSER_CMDFFF_RE_WIDTH            DSPI_MSC_RSER_CMDFFF_RE_WIDTH
#define DSPI_RSER_CMDFFF_RE(x)               DSPI_MSC_RSER_CMDFFF_RE(x)

#define DSPI_RSER_TCF_RE_MASK                DSPI_MSC_RSER_TCF_RE_MASK
#define DSPI_RSER_TCF_RE_SHIFT               DSPI_MSC_RSER_TCF_RE_SHIFT
#define DSPI_RSER_TCF_RE_WIDTH               DSPI_MSC_RSER_TCF_RE_WIDTH
#define DSPI_RSER_TCF_RE(x)                  DSPI_MSC_RSER_TCF_RE(x)
/*! @} */

/*! @name CMD - DSPI_MSC_CMD register */
/*! @{ */

#define DSPI_CMD_CMD_MASK                    DSPI_MSC_CMD_CMD_MASK
#define DSPI_CMD_CMD_SHIFT                   DSPI_MSC_CMD_CMD_SHIFT
#define DSPI_CMD_CMD_WIDTH                   DSPI_MSC_CMD_CMD_WIDTH
#define DSPI_CMD_CMD(x)                      DSPI_MSC_CMD_CMD(x)
/*! @} */

/*! @name TX - DSPI_MSC_TX register */
/*! @{ */

#define DSPI_TX_TX_MASK                      DSPI_MSC_TX_TX_MASK
#define DSPI_TX_TX_SHIFT                     DSPI_MSC_TX_TX_SHIFT
#define DSPI_TX_TX_WIDTH                     DSPI_MSC_TX_TX_WIDTH
#define DSPI_TX_TX(x)                        DSPI_MSC_TX_TX(x)
/*! @} */

/*! @name PUSHR - PUSH TX FIFO Register In Master Mode */
/*! @{ */

#define DSPI_PUSHR_TXDATA_MASK               DSPI_MSC_PUSHR_TXDATA_MASK
#define DSPI_PUSHR_TXDATA_SHIFT              DSPI_MSC_PUSHR_TXDATA_SHIFT
#define DSPI_PUSHR_TXDATA_WIDTH              DSPI_MSC_PUSHR_TXDATA_WIDTH
#define DSPI_PUSHR_TXDATA(x)                 DSPI_MSC_PUSHR_TXDATA(x)

#define DSPI_PUSHR_PCS_MASK                  DSPI_MSC_PUSHR_PCS_MASK
#define DSPI_PUSHR_PCS_SHIFT                 DSPI_MSC_PUSHR_PCS_SHIFT
#define DSPI_PUSHR_PCS_WIDTH                 DSPI_MSC_PUSHR_PCS_WIDTH
#define DSPI_PUSHR_PCS(x)                    DSPI_MSC_PUSHR_PCS(x)

#define DSPI_PUSHR_PP_MCSC_MASK              DSPI_MSC_PUSHR_PP_MASK
#define DSPI_PUSHR_PP_MCSC_SHIFT             DSPI_MSC_PUSHR_PP_SHIFT
#define DSPI_PUSHR_PP_MCSC_WIDTH             DSPI_MSC_PUSHR_PP_WIDTH
#define DSPI_PUSHR_PP_MCSC(x)                DSPI_MSC_PUSHR_PP(x)

#define DSPI_PUSHR_PE_MASC_MASK              DSPI_MSC_PUSHR_PE_MASK
#define DSPI_PUSHR_PE_MASC_SHIFT             DSPI_MSC_PUSHR_PE_SHIFT
#define DSPI_PUSHR_PE_MASC_WIDTH             DSPI_MSC_PUSHR_PE_WIDTH
#define DSPI_PUSHR_PE_MASC(x)                DSPI_MSC_PUSHR_PE(x)

#define DSPI_PUSHR_CTCNT_MASK                DSPI_MSC_PUSHR_CTCNT_MASK
#define DSPI_PUSHR_CTCNT_SHIFT               DSPI_MSC_PUSHR_CTCNT_SHIFT
#define DSPI_PUSHR_CTCNT_WIDTH               DSPI_MSC_PUSHR_CTCNT_WIDTH
#define DSPI_PUSHR_CTCNT(x)                  DSPI_MSC_PUSHR_CTCNT(x)

#define DSPI_PUSHR_EOQ_MASK                  DSPI_MSC_PUSHR_EOQ_MASK
#define DSPI_PUSHR_EOQ_SHIFT                 DSPI_MSC_PUSHR_EOQ_SHIFT
#define DSPI_PUSHR_EOQ_WIDTH                 DSPI_MSC_PUSHR_EOQ_WIDTH
#define DSPI_PUSHR_EOQ(x)                    DSPI_MSC_PUSHR_EOQ(x)

#define DSPI_PUSHR_CTAS_MASK                 DSPI_MSC_PUSHR_CTAS_MASK
#define DSPI_PUSHR_CTAS_SHIFT                DSPI_MSC_PUSHR_CTAS_SHIFT
#define DSPI_PUSHR_CTAS_WIDTH                DSPI_MSC_PUSHR_CTAS_WIDTH
#define DSPI_PUSHR_CTAS(x)                   DSPI_MSC_PUSHR_CTAS(x)

#define DSPI_PUSHR_CONT_MASK                 DSPI_MSC_PUSHR_CONT_MASK
#define DSPI_PUSHR_CONT_SHIFT                DSPI_MSC_PUSHR_CONT_SHIFT
#define DSPI_PUSHR_CONT_WIDTH                DSPI_MSC_PUSHR_CONT_WIDTH
#define DSPI_PUSHR_CONT(x)                   DSPI_MSC_PUSHR_CONT(x)
/*! @} */

/*! @name POPR - POP RX FIFO Register */
/*! @{ */

#define DSPI_POPR_RXDATA_MASK                DSPI_MSC_POPR_RXDATA_MASK
#define DSPI_POPR_RXDATA_SHIFT               DSPI_MSC_POPR_RXDATA_SHIFT
#define DSPI_POPR_RXDATA_WIDTH               DSPI_MSC_POPR_RXDATA_WIDTH
#define DSPI_POPR_RXDATA(x)                  DSPI_MSC_POPR_RXDATA(x)
/*! @} */

/*! @name TXFR - Transmit FIFO Registers */
/*! @{ */

#define DSPI_TXFR_TXDATA_MASK                DSPI_MSC_TXFR_TXDATA_MASK
#define DSPI_TXFR_TXDATA_SHIFT               DSPI_MSC_TXFR_TXDATA_SHIFT
#define DSPI_TXFR_TXDATA_WIDTH               DSPI_MSC_TXFR_TXDATA_WIDTH
#define DSPI_TXFR_TXDATA(x)                  DSPI_MSC_TXFR_TXDATA(x)

#define DSPI_TXFR_TXCMD_TXDATA_MASK          DSPI_MSC_TXFR_TXCMD_TXDATA_MASK
#define DSPI_TXFR_TXCMD_TXDATA_SHIFT         DSPI_MSC_TXFR_TXCMD_TXDATA_SHIFT
#define DSPI_TXFR_TXCMD_TXDATA_WIDTH         DSPI_MSC_TXFR_TXCMD_TXDATA_WIDTH
#define DSPI_TXFR_TXCMD_TXDATA(x)            DSPI_MSC_TXFR_TXCMD_TXDATA(x)
/*! @} */

/*! @name RXFR - Receive FIFO Registers */
/*! @{ */

#define DSPI_RXFR_RXDATA_MASK                DSPI_MSC_RXFR_RXDATA_MASK
#define DSPI_RXFR_RXDATA_SHIFT               DSPI_MSC_RXFR_RXDATA_SHIFT
#define DSPI_RXFR_RXDATA_WIDTH               DSPI_MSC_RXFR_RXDATA_WIDTH
#define DSPI_RXFR_RXDATA(x)                  DSPI_MSC_RXFR_RXDATA(x)
/*! @} */

/*! @name DSICR0 - DSI Configuration Register 0 */
/*! @{ */

#define DSPI_DSICR0_DPCSx_MASK               DSPI_MSC_DSICR0_DPCSx_MASK
#define DSPI_DSICR0_DPCSx_SHIFT              DSPI_MSC_DSICR0_DPCSx_SHIFT
#define DSPI_DSICR0_DPCSx_WIDTH              DSPI_MSC_DSICR0_DPCSx_WIDTH
#define DSPI_DSICR0_DPCSx(x)                 DSPI_MSC_DSICR0_DPCSx(x)

#define DSPI_DSICR0_PP_MASK                  DSPI_MSC_DSICR0_PP_MASK
#define DSPI_DSICR0_PP_SHIFT                 DSPI_MSC_DSICR0_PP_SHIFT
#define DSPI_DSICR0_PP_WIDTH                 DSPI_MSC_DSICR0_PP_WIDTH
#define DSPI_DSICR0_PP(x)                    DSPI_MSC_DSICR0_PP(x)

#define DSPI_DSICR0_PE_MASK                  DSPI_MSC_DSICR0_PE_MASK
#define DSPI_DSICR0_PE_SHIFT                 DSPI_MSC_DSICR0_PE_SHIFT
#define DSPI_DSICR0_PE_WIDTH                 DSPI_MSC_DSICR0_PE_WIDTH
#define DSPI_DSICR0_PE(x)                    DSPI_MSC_DSICR0_PE(x)

#define DSPI_DSICR0_PES_MASK                 DSPI_MSC_DSICR0_PES_MASK
#define DSPI_DSICR0_PES_SHIFT                DSPI_MSC_DSICR0_PES_SHIFT
#define DSPI_DSICR0_PES_WIDTH                DSPI_MSC_DSICR0_PES_WIDTH
#define DSPI_DSICR0_PES(x)                   DSPI_MSC_DSICR0_PES(x)

#define DSPI_DSICR0_DMS_MASK                 DSPI_MSC_DSICR0_DMS_MASK
#define DSPI_DSICR0_DMS_SHIFT                DSPI_MSC_DSICR0_DMS_SHIFT
#define DSPI_DSICR0_DMS_WIDTH                DSPI_MSC_DSICR0_DMS_WIDTH
#define DSPI_DSICR0_DMS(x)                   DSPI_MSC_DSICR0_DMS(x)

#define DSPI_DSICR0_DSICTAS_MASK             DSPI_MSC_DSICR0_DSICTAS_MASK
#define DSPI_DSICR0_DSICTAS_SHIFT            DSPI_MSC_DSICR0_DSICTAS_SHIFT
#define DSPI_DSICR0_DSICTAS_WIDTH            DSPI_MSC_DSICR0_DSICTAS_WIDTH
#define DSPI_DSICR0_DSICTAS(x)               DSPI_MSC_DSICR0_DSICTAS(x)

#define DSPI_DSICR0_DCONT_MASK               DSPI_MSC_DSICR0_DCONT_MASK
#define DSPI_DSICR0_DCONT_SHIFT              DSPI_MSC_DSICR0_DCONT_SHIFT
#define DSPI_DSICR0_DCONT_WIDTH              DSPI_MSC_DSICR0_DCONT_WIDTH
#define DSPI_DSICR0_DCONT(x)                 DSPI_MSC_DSICR0_DCONT(x)

#define DSPI_DSICR0_CID_MASK                 DSPI_MSC_DSICR0_CID_MASK
#define DSPI_DSICR0_CID_SHIFT                DSPI_MSC_DSICR0_CID_SHIFT
#define DSPI_DSICR0_CID_WIDTH                DSPI_MSC_DSICR0_CID_WIDTH
#define DSPI_DSICR0_CID(x)                   DSPI_MSC_DSICR0_CID(x)

#define DSPI_DSICR0_TRRE_MASK                DSPI_MSC_DSICR0_TRRE_MASK
#define DSPI_DSICR0_TRRE_SHIFT               DSPI_MSC_DSICR0_TRRE_SHIFT
#define DSPI_DSICR0_TRRE_WIDTH               DSPI_MSC_DSICR0_TRRE_WIDTH
#define DSPI_DSICR0_TRRE(x)                  DSPI_MSC_DSICR0_TRRE(x)

#define DSPI_DSICR0_TPOL_MASK                DSPI_MSC_DSICR0_TPOL_MASK
#define DSPI_DSICR0_TPOL_SHIFT               DSPI_MSC_DSICR0_TPOL_SHIFT
#define DSPI_DSICR0_TPOL_WIDTH               DSPI_MSC_DSICR0_TPOL_WIDTH
#define DSPI_DSICR0_TPOL(x)                  DSPI_MSC_DSICR0_TPOL(x)

#define DSPI_DSICR0_TXSS_MASK                DSPI_MSC_DSICR0_TXSS_MASK
#define DSPI_DSICR0_TXSS_SHIFT               DSPI_MSC_DSICR0_TXSS_SHIFT
#define DSPI_DSICR0_TXSS_WIDTH               DSPI_MSC_DSICR0_TXSS_WIDTH
#define DSPI_DSICR0_TXSS(x)                  DSPI_MSC_DSICR0_TXSS(x)

#define DSPI_DSICR0_TSBC_MASK                DSPI_MSC_DSICR0_TSBC_MASK
#define DSPI_DSICR0_TSBC_SHIFT               DSPI_MSC_DSICR0_TSBC_SHIFT
#define DSPI_DSICR0_TSBC_WIDTH               DSPI_MSC_DSICR0_TSBC_WIDTH
#define DSPI_DSICR0_TSBC(x)                  DSPI_MSC_DSICR0_TSBC(x)

