TEAM-RD0105/MasterProject/MasterModel/RD0105FirmwareModel_Config/RTD/include/S32K39_DSPI_MSC_WRAPPER.h
#define DSPI_DSICR0_ITSB_MASK                DSPI_MSC_DSICR0_ITSB_MASK
#define DSPI_DSICR0_ITSB_SHIFT               DSPI_MSC_DSICR0_ITSB_SHIFT
#define DSPI_DSICR0_ITSB_WIDTH               DSPI_MSC_DSICR0_ITSB_WIDTH
#define DSPI_DSICR0_ITSB(x)                  DSPI_MSC_DSICR0_ITSB(x)

#define DSPI_DSICR0_TRG_MASK                 DSPI_MSC_DSICR0_TRG_MASK
#define DSPI_DSICR0_TRG_SHIFT                DSPI_MSC_DSICR0_TRG_SHIFT
#define DSPI_DSICR0_TRG_WIDTH                DSPI_MSC_DSICR0_TRG_WIDTH
#define DSPI_DSICR0_TRG(x)                   DSPI_MSC_DSICR0_TRG(x)

#define DSPI_DSICR0_FMSZ5_MASK               DSPI_MSC_DSICR0_FMSZ5_MASK
#define DSPI_DSICR0_FMSZ5_SHIFT              DSPI_MSC_DSICR0_FMSZ5_SHIFT
#define DSPI_DSICR0_FMSZ5_WIDTH              DSPI_MSC_DSICR0_FMSZ5_WIDTH
#define DSPI_DSICR0_FMSZ5(x)                 DSPI_MSC_DSICR0_FMSZ5(x)

#define DSPI_DSICR0_FMSZ4_MASK               DSPI_MSC_DSICR0_FMSZ4_MASK
#define DSPI_DSICR0_FMSZ4_SHIFT              DSPI_MSC_DSICR0_FMSZ4_SHIFT
#define DSPI_DSICR0_FMSZ4_WIDTH              DSPI_MSC_DSICR0_FMSZ4_WIDTH
#define DSPI_DSICR0_FMSZ4(x)                 DSPI_MSC_DSICR0_FMSZ4(x)
/*! @} */

/*! @name SDR0 - DSI Serialization Data Register 0 */
/*! @{ */

#define DSPI_SDR0_SER_DATA_MASK              DSPI_MSC_SDR0_SER_DATA_MASK
#define DSPI_SDR0_SER_DATA_SHIFT             DSPI_MSC_SDR0_SER_DATA_SHIFT
#define DSPI_SDR0_SER_DATA_WIDTH             DSPI_MSC_SDR0_SER_DATA_WIDTH
#define DSPI_SDR0_SER_DATA(x)                DSPI_MSC_SDR0_SER_DATA(x)
/*! @} */

/*! @name ASDR0 - DSI Alternate Serialization Data Register 0 */
/*! @{ */

#define DSPI_ASDR0_ASER_DATA_MASK            DSPI_MSC_ASDR0_ASER_DATA_MASK
#define DSPI_ASDR0_ASER_DATA_SHIFT           DSPI_MSC_ASDR0_ASER_DATA_SHIFT
#define DSPI_ASDR0_ASER_DATA_WIDTH           DSPI_MSC_ASDR0_ASER_DATA_WIDTH
#define DSPI_ASDR0_ASER_DATA(x)              DSPI_MSC_ASDR0_ASER_DATA(x)
/*! @} */

/*! @name COMPR0 - DSI Transmit Comparison Register 0 */
/*! @{ */

#define DSPI_COMPR0_COMP_DATA_MASK           DSPI_MSC_COMPR0_COMP_DATA_MASK
#define DSPI_COMPR0_COMP_DATA_SHIFT          DSPI_MSC_COMPR0_COMP_DATA_SHIFT
#define DSPI_COMPR0_COMP_DATA_WIDTH          DSPI_MSC_COMPR0_COMP_DATA_WIDTH
#define DSPI_COMPR0_COMP_DATA(x)             DSPI_MSC_COMPR0_COMP_DATA(x)
/*! @} */

/*! @name DDR0 - DSI Deserialization Data Register 0 */
/*! @{ */

#define DSPI_DDR0_DESER_DATA_MASK            DSPI_MSC_DDR0_DESER_DATA_MASK
#define DSPI_DDR0_DESER_DATA_SHIFT           DSPI_MSC_DDR0_DESER_DATA_SHIFT
#define DSPI_DDR0_DESER_DATA_WIDTH           DSPI_MSC_DDR0_DESER_DATA_WIDTH
#define DSPI_DDR0_DESER_DATA(x)              DSPI_MSC_DDR0_DESER_DATA(x)
/*! @} */

/*! @name DSICR1 - DSI Configuration Register 1 */
/*! @{ */

#define DSPI_DSICR1_DPCS1_x_MASK             DSPI_MSC_DSICR1_DPCS1_x_MASK
#define DSPI_DSICR1_DPCS1_x_SHIFT            DSPI_MSC_DSICR1_DPCS1_x_SHIFT
#define DSPI_DSICR1_DPCS1_x_WIDTH            DSPI_MSC_DSICR1_DPCS1_x_WIDTH
#define DSPI_DSICR1_DPCS1_x(x)               DSPI_MSC_DSICR1_DPCS1_x(x)

#define DSPI_DSICR1_DSE0_MASK                DSPI_MSC_DSICR1_DSE0_MASK
#define DSPI_DSICR1_DSE0_SHIFT               DSPI_MSC_DSICR1_DSE0_SHIFT
#define DSPI_DSICR1_DSE0_WIDTH               DSPI_MSC_DSICR1_DSE0_WIDTH
#define DSPI_DSICR1_DSE0(x)                  DSPI_MSC_DSICR1_DSE0(x)

#define DSPI_DSICR1_DSE1_MASK                DSPI_MSC_DSICR1_DSE1_MASK
#define DSPI_DSICR1_DSE1_SHIFT               DSPI_MSC_DSICR1_DSE1_SHIFT
#define DSPI_DSICR1_DSE1_WIDTH               DSPI_MSC_DSICR1_DSE1_WIDTH
#define DSPI_DSICR1_DSE1(x)                  DSPI_MSC_DSICR1_DSE1(x)

#define DSPI_DSICR1_DSI64E_MASK              DSPI_MSC_DSICR1_DSI64E_MASK
#define DSPI_DSICR1_DSI64E_SHIFT             DSPI_MSC_DSICR1_DSI64E_SHIFT
#define DSPI_DSICR1_DSI64E_WIDTH             DSPI_MSC_DSICR1_DSI64E_WIDTH
#define DSPI_DSICR1_DSI64E(x)                DSPI_MSC_DSICR1_DSI64E(x)

#define DSPI_DSICR1_CSE_MASK                 DSPI_MSC_DSICR1_CSE_MASK
#define DSPI_DSICR1_CSE_SHIFT                DSPI_MSC_DSICR1_CSE_SHIFT
#define DSPI_DSICR1_CSE_WIDTH                DSPI_MSC_DSICR1_CSE_WIDTH
#define DSPI_DSICR1_CSE(x)                   DSPI_MSC_DSICR1_CSE(x)

#define DSPI_DSICR1_TSBCNT_MASK              DSPI_MSC_DSICR1_TSBCNT_MASK
#define DSPI_DSICR1_TSBCNT_SHIFT             DSPI_MSC_DSICR1_TSBCNT_SHIFT
#define DSPI_DSICR1_TSBCNT_WIDTH             DSPI_MSC_DSICR1_TSBCNT_WIDTH
#define DSPI_DSICR1_TSBCNT(x)                DSPI_MSC_DSICR1_TSBCNT(x)
/*! @} */

/*! @name SSR0 - DSI Serialization Source Select Register 0 */
/*! @{ */

#define DSPI_SSR0_SS_MASK                    DSPI_MSC_SSR0_SS_MASK
#define DSPI_SSR0_SS_SHIFT                   DSPI_MSC_SSR0_SS_SHIFT
#define DSPI_SSR0_SS_WIDTH                   DSPI_MSC_SSR0_SS_WIDTH
#define DSPI_SSR0_SS(x)                      DSPI_MSC_SSR0_SS(x)
/*! @} */

/*! @name DIMR0 - DSI Deserialized Data Interrupt Mask Register 0 */
/*! @{ */

#define DSPI_DIMR0_MASK_MASK                 DSPI_MSC_DIMR0_MASK_MASK
#define DSPI_DIMR0_MASK_SHIFT                DSPI_MSC_DIMR0_MASK_SHIFT
#define DSPI_DIMR0_MASK_WIDTH                DSPI_MSC_DIMR0_MASK_WIDTH
#define DSPI_DIMR0_MASK(x)                   DSPI_MSC_DIMR0_MASK(x)
/*! @} */

/*! @name DPIR0 - DSI Deserialized Data Polarity Interrupt Register 0 */
/*! @{ */

#define DSPI_DPIR0_DP_MASK                   DSPI_MSC_DPIR0_DP_MASK
#define DSPI_DPIR0_DP_SHIFT                  DSPI_MSC_DPIR0_DP_SHIFT
#define DSPI_DPIR0_DP_WIDTH                  DSPI_MSC_DPIR0_DP_WIDTH
#define DSPI_DPIR0_DP(x)                     DSPI_MSC_DPIR0_DP(x)
/*! @} */

/*! @name SDR1 - DSI Serialization Data Register 1 */
/*! @{ */

#define DSPI_SDR1_SER_DATA_MASK              DSPI_MSC_SDR1_SER_DATA_MASK
#define DSPI_SDR1_SER_DATA_SHIFT             DSPI_MSC_SDR1_SER_DATA_SHIFT
#define DSPI_SDR1_SER_DATA_WIDTH             DSPI_MSC_SDR1_SER_DATA_WIDTH
#define DSPI_SDR1_SER_DATA(x)                DSPI_MSC_SDR1_SER_DATA(x)
/*! @} */

/*! @name ASDR1 - DSI Alternate Serialization Data Register 1 */
/*! @{ */

#define DSPI_ASDR1_ASER_DATA_MASK            DSPI_MSC_ASDR1_ASER_DATA_MASK
#define DSPI_ASDR1_ASER_DATA_SHIFT           DSPI_MSC_ASDR1_ASER_DATA_SHIFT
#define DSPI_ASDR1_ASER_DATA_WIDTH           DSPI_MSC_ASDR1_ASER_DATA_WIDTH
#define DSPI_ASDR1_ASER_DATA(x)              DSPI_MSC_ASDR1_ASER_DATA(x)
/*! @} */

/*! @name COMPR1 - DSI Transmit Comparison Register 1 */
/*! @{ */

#define DSPI_COMPR1_COMP_DATA_MASK           DSPI_MSC_COMPR1_COMP_DATA_MASK
#define DSPI_COMPR1_COMP_DATA_SHIFT          DSPI_MSC_COMPR1_COMP_DATA_SHIFT
#define DSPI_COMPR1_COMP_DATA_WIDTH          DSPI_MSC_COMPR1_COMP_DATA_WIDTH
#define DSPI_COMPR1_COMP_DATA(x)             DSPI_MSC_COMPR1_COMP_DATA(x)
/*! @} */

/*! @name DDR1 - DSI Deserialization Data Register 1 */
/*! @{ */

